//Реализуйте структуру телефонной книги с помощью HashMap, учитывая, что 1 человек может иметь несколько телефонов.

import java.util.HashMap;
import java.util.List;

public class task_1 {

    public static void main(String[] args) {
        HashMap<Integer, String> phonebook = new HashMap<>();
        List<String> nameNum = List.of("Иван Иванов, 111-222-331, 111-222-372",
                                        "Светлана Петрова, 111-222-333",
                                        "Кристина Белова, 444-555-666",
                                        "Анна Мусина, 777-888-999",
                                        "Анна Крутова, 222-333-444",
                                        "Иван Юрин, 555-666-777, 777-888-999",
                                        "Петр Лыков, 888-999-000",
                                        "Павел Чернов, 333-444-555",
                                        "Петр Чернышов, 666-777-888",
                                        "Мария Федорова, 999-000-111",
                                        "Марина Светлова, 111-222-333",
                                        "Мария Савина, 111-222-333",
                                        "Мария Рыкова, 444-555-666",
                                        "Марина Лугова, 444-555-666",
                                        "Анна Владимирова, 444-555-666",
                                        "Иван Мечников, 555-666-777",
                                        "Петр Петин, 555-666-777",
                                        "Иван Ежов, 777-888-999");

        for (int j = 0; j < nameNum.size(); j++) {
            phonebook.put(j, nameNum.get(j));
        }
        for (int i = 0; i < nameNum.size(); i++) {
            System.out.println(phonebook.get(i));
        } 
    }
}